app/controllers/todos_controller.rb

  def update
    todo = user.todos.find(params[:id]).update(todo_params)
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]

  def destroy
    todo = user.todos.find(params[:id]).destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]

  def index
    todos = user.todos.all
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 3]]