app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "kings"], ["email", "kings@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-23 07:54:21.927102"], ["updated_at", "2023-03-23 07:54:21.927102"]]
---
  def register
    user = User.create(user_params)

SELECT "users".* FROM "users" WHERE (username = 'kingsley' OR email = NULL) ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def login
    sql = "username = :username OR email = :email"
    user = User.where(sql, { username: user_params[:username], email: user_params[:email] }).first